app/views/user_mailer/notify_comment.text.erb

INSERT INTO "comments" ("comment", "commentable_type", "commentable_id", "user_id", "created_at", "updated_at", "parent_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
You have a comment: <%= @comment.comment%>
commented at: <%= @comment.created_at%>