app/controllers/comments_controller.rb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def add_expense_comment
    @expense = Expense.find(params[:expense_id])

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]
---
  def index_expense_comments
    @comments = Expense.find(params[:expense_id]).comments

SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]
---
  def add_report_comment
    @report = Report.find(params[:report_id])

SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def index_report_comments
    @comments = Report.find(params[:report_id]).comments