app/controllers/expenses_controller.rb

  def show
    find_user
    authorize @user, :access_enabled?
    @expense = @user.expenses.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ? AND "expenses"."id" = ? LIMIT ?  [["user_id", 39], ["id", 1], ["LIMIT", 1]]

  def update
    find_user
    authorize @user, :access_enabled?
    expense_args = process_expense
    unless @expense.update(expense_args)
---
UPDATE "expenses" SET "description" = ?, "amount" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["description", "brokerage"], ["amount", 99], ["updated_at", "2022-08-07 17:58:11.950543"], ["id", 1]]

  def add_user_expense
    @expense = @user.expenses.create(create_expense_args)
---
INSERT INTO "expenses" ("description", "amount", "date", "invoice_number", "status", "user_id", "created_at", "updated_at", "report_id", "approved_amount") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def find_user
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 63], ["LIMIT", 1]]

  def notify_expense_update
    UserMailer.with(user: @user, expense: @expense).expense_update.deliver_now
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ? AND "expenses"."id" = ? LIMIT ?  [["user_id", 50], ["id", 8], ["LIMIT", 1]]

  def process_expense
    if current_user.admin?
      @expense = Expense.find(params[:id])
      authorize_submitted_expense
      admin_update_args
    else
      @expense = @user.expenses.find(params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ? AND "expenses"."id" = ? LIMIT ?  [["user_id", 63], ["id", 7], ["LIMIT", 1]]