app/controllers/reports_controller.rb

INSERT INTO "reports" ("status", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["status", 0], ["created_at", "2022-08-07 18:02:05.916751"], ["updated_at", "2022-08-07 18:02:05.916751"], ["user_id", 63]]
---
  def create
    find_user
    authorize @user
    @report = @user.reports.create(status: 'drafted', expenses:)

SELECT "reports".* FROM "reports" WHERE "reports"."user_id" = ? AND "reports"."id" = ? LIMIT ?  [["user_id", 63], ["id", 1], ["LIMIT", 1]]
---
  def show
    find_user
    authorize @user, :access_enabled?
    @report = @user.reports.find(params[:id])

UPDATE "reports" SET "status" = ?, "updated_at" = ? WHERE "reports"."id" = ?  [["status", 2], ["updated_at", "2022-08-07 18:04:09.013123"], ["id", 1]]
---
  def update
    find_user
    authorize @user, :access_enabled?
    report_args = process_report
    unless @report.update(report_args)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
---
  def find_user
    @user = User.find(params[:user_id])

SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ?  [["user_id", 63]]
---
  def expenses
    @user.expenses.select { |expense| params[:expenses].include?(expense.id) }

SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]
SELECT "reports".* FROM "reports" WHERE "reports"."user_id" = ? AND "reports"."id" = ? LIMIT ?  [["user_id", 50], ["id", 57], ["LIMIT", 1]]
---
  def process_report
    if current_user.admin?
      @report = Report.find(params[:id])
      raise_restricted_action('cannot act upon draft version') if @report.drafted?
      process_depenedent_expenses
      admin_update_args
    else
      @report = @user.reports.find(params[:id])

UPDATE "expenses" SET "updated_at" = ?, "report_id" = ? WHERE "expenses"."id" = ?  [["updated_at", "2022-08-03 12:55:12.824848"], ["report_id", 1], ["id", 3]]
---
  def process_depenedent_expenses
    @report.update_dependent_expense(params[:report][:expenses])