app/controllers/sessions_controller.rb

  def create
    email = params[:email]
    @user = User.find_by(email:)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "david@mail.com"], ["LIMIT", 1]]