app/controllers/users_controller.rb

  def create
    @user = User.create(onboard_args)
---
INSERT INTO "users" ("name", "department", "status", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def signup
    email = params[:user][:email]
    @user = User.find_by(email:)
    raise_user_not_found(email) if @user.nil?
    @user.update(password: params[:user][:password])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@mail.com"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2022-08-04 05:25:47.672637"], ["id", 49]]