app/models/expense.rb

INSERT INTO "comments" ("comment", "commentable_type", "commentable_id", "user_id", "created_at", "updated_at", "parent_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def add_comment(user_id, args)
    comments.create(parent_id: args[:parent_id], comment: args[:comment], user_id: user_id)