app/models/report.rb

  def submit_dependent_expense
    if status == 'submitted'
      expenses.select { |e| e.drafted? }.each do |expense|
        json = invoice_validator_response(expense.invoice_number)
        response = json['status'] ? 'verified' : 'rejected'
        expense.update(status: response) if expense.drafted?
---
UPDATE "expenses" SET "status" = ?, "updated_at" = ? WHERE "expenses"."id" = ?  [["status", 4], ["updated_at", "2022-08-08 10:04:59.904317"], ["id", 11]]

  def update_dependent_expense(update_expenses)
    update_expenses.each do |e|
      expense = expenses.find(e[:id])
      expense.update(status: e[:status], approved_amount: e[:approved_amount]) if expense.verified?
---
UPDATE "expenses" SET "status" = ?, "updated_at" = ?, "approved_amount" = ? WHERE "expenses"."id" = ?  [["status", 3], ["updated_at", "2022-08-08 10:13:02.919573"], ["approved_amount", 250], ["id", 12]]

  def add_comment(user_id, args)
    comments.create(parent_id: args[:parent_id], comment: args[:comment], user_id: user_id)
---
INSERT INTO "comments" ("comment", "commentable_type", "commentable_id", "user_id", "created_at", "updated_at", "parent_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def filter_out_processed
    @already_processed_expenses = []
    expenses.each do |expense|
      log_mapped_expense(expense) unless expense.report_id.nil? && expense.drafted?
    end
    self.expenses = expenses.reject { |expense| @already_processed_expenses.include?(expense.id) }
    raise_validation_error if expenses.size.zero?
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."report_id" = ? AND "expenses"."id" = ? LIMIT ?  [["report_id", 53], ["id", 5], ["LIMIT", 1]]
SELECT COUNT(*) FROM "expenses" WHERE "expenses"."report_id" = ?  [["report_id", 45]]
SELECT "expenses".* FROM "expenses" WHERE "expenses"."report_id" = ? AND "expenses"."id" = ? LIMIT ?  [["report_id", 53], ["id", 16], ["LIMIT", 1]]

  def log_mapped_expense(expense)
    logger.error("expense #{expense.id} is already mapped or processed report #{expense.report_id}")
    @already_processed_expenses.push(expense.id)
---
UPDATE "expenses" SET "status" = ?, "updated_at" = ?, "approved_amount" = ? WHERE "expenses"."id" = ?  [["status", 3], ["updated_at", "2022-08-06 17:41:13.394104"], ["approved_amount", 100], ["id", 17]]