app/models/user.rb

  def add_roles(roles)
    roles.each do |role|
      user_roles.create(role:)
---
INSERT INTO "user_roles" ("role", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["role", 0], ["user_id", 58], ["created_at", "2022-08-03 18:38:43.855205"], ["updated_at", "2022-08-03 18:38:43.855205"]]