app/controllers/concerns/invoice_validator.rb

INSERT INTO "invoices" ("invoice_number", "biller", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["invoice_number", 892], ["biller", "Skaboo"], ["created_at", "2022-08-03 09:53:26.361249"], ["updated_at", "2022-08-03 09:53:26.361249"]]
---
  def store_invoice_validations(json)
    Invoice.create(invoice_number: invoice_number, biller: json['biller name'])